Revit 2027 API
SchedulableField Properties
The SchedulableField type exposes the following members.
Properties
Name | Description
FieldType |  The type of data displayed by the field.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ParameterId |  The ID of the parameter displayed by the field.
Top
See Also
Reference
SchedulableField Class
Autodesk.Revit.DB Namespace